#!/usr/bin/env python3
import sys

                                                        # 1. นับจำนวนพารามิเตอร์ทั้งหมดใน sys.argv แล้วลบออกด้วย 1 
                                                        # เพราะตัวแรกสุด (ดัชนีที่ 0) จะเป็นชื่อไฟล์โปรแกรมเสมอ ไม่นับเป็นพารามิเตอร์ที่ส่งเข้ามา
number_of_parameters = len(sys.argv) - 1

                                                        # 2. แสดงผลลัพธ์ตามรูปแบบที่โจทย์กำหนด พร้อมตามด้วยจุด (.) ข้างหลังตัวเลข
print(f"Number of parameters: {number_of_parameters}.")






'''
========================== การสร้าง  ==========================









==============================================================================
'''


