#!/usr/bin/env python3
import sys

    
args = sys.argv[1:]             # ดึงรายการ arguments ที่ส่งเข้ามา (ตัดตำแหน่งที่ 0 ซึ่งเป็นชื่อไฟล์ออก)

num_params = len(args)          # คำนวณจำนวนพารามิเตอร์

if num_params == 0:
    print("none")
else:
    print(f"parameters: {num_params}")              # พิมพ์จำนวนพารามิเตอร์ทั้งหมด

    for parameter in args:                          # วนลูป 'for' เพื่อแสดงคำและความยาวของคำนั้นๆ
        print(f"{parameter}: {len(parameter)}")





'''
========================== การสร้าง Argument Vector : Argv ==========================
syntax:     import sys
# ทำการดึงโมดูลระบบเข้ามา เพื่อให้เราสามารถใช้คำสั่งรับค่าอาร์กิวเมนต์จากภายนอกโปรแกรมได้

ไม่ใส่ไม่ได้ หากต้องการรับค่าพารามิเตอร์ที่พิมพ์ต่อท้ายคำสั่งใน Terminal 
(เช่น ./count_it.py "Game" "of" "Thrones") จำเป็นต้องใช้ import sys ครับ

เหตุผลเพราะว่าภาษา Python โดยตัวมันเองจะไม่รู้เลยว่าผู้ใช้งานพิมพ์คำว่าอะไรต่อท้ายมาบ้าง 
ตัวแปร sys.argv ที่เราเรียกใช้นั้นเปรียบเสมือน "สะพาน" ที่ทำหน้าที่ไปดึงข้อมูลคำเหล่านั้นมาจากTerminal 
เข้ามาอยู่ในโค้ดของเรา

ถ้าเราไม่เขียน import sys แล้วฝืนเรียกใช้ sys.argv โปรแกรมจะทำงานไม่ได้และแจ้งข้อผิดพลาดทันทีว่า:
NameError: name 'sys' is not defined (แปลว่า: ระบบไม่รู้จักคำสั่งที่ชื่อ sys)


syntax:     var = argv[0:]

• argv ย่อมาจาก Argument Vector (or variable)
	• คำว่า Argument แปลว่า ค่าที่ส่งเข้ามาให้โปรแกรมทำงาน
	• คำว่า Vector ในทางคอมพิวเตอร์หมายถึง Array หรือ List (รายการข้อมูล)
	• ดังนั้น sys.argv รวมกันจึงแปลว่า "รายการของอาร์กิวเมนต์/พารามิเตอร์ทั้งหมดที่ถูกส่งเข้ามายังโปรแกรมผ่าน 
      Command Line"

• args = sys.argv[1:]
	• ปกติแล้วในคอมพิวเตอร์ ข้อมูลตัวแรกในรายการ sys.argv[0] จะเก็บ ชื่อไฟล์ เสมอ (ในที่นี้คือ ./count_it.py)
	• sys.argv[1:] คือการตัดเอาเฉพาะข้อมูลตั้งแต่วันที่/ข้อความตัวที่ 1 เป็นต้นไป (ไม่เอาชื่อไฟล์) เพื่อนำมาใช้งานต่อ
      

==============================================================================
len(var)
	• ฟังก์ชัน len() ย่อมาจาก Length ทำหน้าที่นับจำนวนสมาชิกทั้งหมดที่อยู่ใน List

for arg in args::
    คำสั่งวนลูปเพื่อหยิบข้อมูลทีละตัวจากกลุ่มข้อมูล args มาเก็บไว้ในตัวแปร arg ทีละรอบ จนกว่าจะครบทุกตัว 
    (ใช้แทนลูป while ตามเงื่อนไขของโจทย์)

==============================================================================
'''
