#!/usr/bin/env python3
import sys

def main():
                                                # 1. ตรวจสอบจำนวน Parameter ที่ส่งเข้ามา
    if len(sys.argv) != 3:                      # ชื่อไฟล์คือตำแหน่งที่ 0 ถ้ามีตัวเลขส่งมาอีก 2 ตัว ความยาวของ sys.argv ต้องเท่ากับ 3
        print("none")
        return

    try:        
        start_num = int(sys.argv[1])                        # 2. แปลงข้อความ (String) ที่รับมาจาก Terminal ให้กลายเป็นตัวเลข (Integer)
        end_num = int(sys.argv[2])
                                                            # 3. สร้างช่วงของตัวเลขโดยใช้ range() 
                                                            # เงื่อนไขโจทย์ต้องการให้รวมตัวสุดท้ายด้วย (เช่น 10 ถึง 14 ต้องได้)
        number_range = range(start_num, end_num + 1)        # ดังนั้นตำแหน่งสิ้นสุดใน range ต้องบวกเพิ่มไป 1 -> (end_num + 1)
        
        result_list = list(number_range)                    # 4. แปลงจากช่วงข้อมูล (range) ให้กลายเป็นอาเรย์หรือลิสต์ [ ] แล้วพิมพ์แสดงผล
        print(result_list)
        
    except ValueError:
        print("none")                   # หากผู้ใช้พิมพ์สิ่งที่ไม่ใช่ตัวเลขเข้ามา (เช่น ข้อความตัวอักษร) จะแสดงคำว่า none

if __name__ == '__main__':
    main()






'''
========================== การสร้าง  ==========================


2. ฟังก์ชัน range(start, stop)

• ความหมาย: แปลว่า "ช่วงของข้อมูล" หรือขอบเขต

• วิธีใช้: ใช้สำหรับสร้างชุดตัวเลขเรียงลำดับแบบอัตโนมัติ
• ข้อควรระวังที่สำคัญมาก: ฟังก์ชัน range ใน Python มีพฤติกรรมคือ "เอาตัวเริ่ม แต่ไม่เอาตัวจบ"
	• ถ้าเราเขียน range(10, 14) ผลลัพธ์ที่ได้จะมีแค่ 10, 11, 12, 13 (เลข 14 จะโดนตัดออก)
	• จากตัวอย่างโจทย์เมื่อใส่ 10 14 ผลลัพธ์ที่ต้องการคือ [10, 11, 12, 13, 14] (เอาเลข 14 ด้วย) เราจึงต้องเขียนจุดสิ้นสุดขยับไปอีก 1 ค่า เป็น range(start_num, end_num + 1) เพื่อให้คลุมถึงตัวเลขสุดท้ายครับ

3. คำสั่ง list()

• ความหมาย: แปลว่า "รายการ" หรือในภาษาโปรแกรมอื่น ๆ เรียกว่าการสร้าง Array (อาเรย์)
• วิธีใช้: เนื่องจากคำสั่ง range() จะให้ผลลัพธ์ในรูปแบบวัตถุพิเศษของ Python 
  (พิมพ์ออกมาตรง ๆ จะเห็นเป็นคำว่า range(10, 15)) เราจึงต้องสวมคำสั่ง list() ครอบลงไป 
  เพื่อแปลงผลลัพธ์นั้นให้ออกมาเป็นกล่องชุดข้อมูลที่มีวงเล็บเหลี่ยมครอบ [10, 11, 12, 13, 14] 
  ตามที่หน้าจอในโจทย์ต้องการแสดงผลครับ

4. โครงสร้าง try ... except ValueError

• ความหมาย: แปลว่า "ลองทำดู...ถ้าเกิดข้อผิดพลาดประเภทนี้ ให้ทำแบบนี้แทน"
• วิธีใช้: เป็นการดักจับข้อผิดพลาด (Error Handling) 
  ป้องกันโปรแกรมพังในกรณีที่ผู้ใช้เกิดใส่ข้อมูลมาเป็นตัวอักษรแทนที่จะเป็นตัวเลข 
  เช่น พิมพ์ ./free_range.py ten fourteen โปรแกรมจะวิ่งมาที่ except 
  และพิมพ์ none อย่างปลอดภัย ไม่ระเบิดเออร์เรอร์สีแดงออกมาหน้าจอครับ







==============================================================================
'''


