#!/usr/bin/env python3

# รับอินพุตครั้งแรกเพื่อเริ่มต้นคำถาม
user_input = input("What you gotta say? : ")

while user_input != "STOP":                                 # เริ่มต้น loop ทำงานไปเรื่อยๆ จนกว่าเงื่อนไขจะเป็นเท็จ
    user_input = input("I got that! Anything else? : ")     # รับอินพุตครั้งถัดไป และแสดงข้อความ "I got that! Anything else? : "








'''
========================== การสร้าง  ==========================


3. while

• ย่อมาจาก: เป็นคำภาษาอังกฤษ แปลว่า "ในขณะที่..."

• วิธีใช้: เป็นคำสั่งสำหรับสร้าง Loop (การทำงานวนซ้ำ) 
  โดยมันจะทำการตรวจสอบเงื่อนไขที่อยู่ข้างหลังตัวมัน ถ้าเงื่อนไขเป็นจริง (True) 
  มันจะวิ่งเข้าไปทำงานในบล็อกโค้ดด้านล่างซ้ำไปเรื่อยๆ 
  แต่ถ้าเงื่อนไขกลายเป็นเท็จ (False) มันจะหยุดทำงานทันที

• ตัวอย่างในโค้ด: while user_input != "STOP":
	• เครื่องหมาย != หมายถึง "ไม่เท่ากับ"
	• แปลเป็นภาษาพูดคือ: "ในขณะที่ตัวแปร user_input ยังไม่เท่ากับคำว่า "STOP" ให้ทำตามคำสั่งข้างล่างนี้ต่อไป"







==============================================================================
'''