#!/usr/bin/env python3

import math                                 # นำเข้าโมดูลคณิตศาสตร์เพื่อใช้ฟังก์ชันปัดเศษ

                                            # รับอินพุตจากผู้ใช้ และแปลงจากตัวหนังสือให้เป็นตัวเลขทศนิยม (Float)
num = float(input("Give me a number: "))

rounded_num = math.ceil(num)                # ปัดเศษขึ้นให้เป็นจำนวนเต็ม และเก็บในตัวแปร rounded_num

print(rounded_num)                          # แสดงผลลัพธ์






'''
========================== การสร้าง  ==========================


1. import math

• ย่อมาจาก: Import Mathematics Module (การนำเข้าชุดคำสั่งคณิตศาสตร์)
• วิธีใช้: ใน Python มีเครื่องมือพื้นฐานให้ใช้อยู่แล้วระดับหนึ่ง แต่ถ้าต้องการฟังก์ชันทางคณิตศาสตร์ที่ขั้นสูงขึ้น (เช่น พาย \(\pi \), ถอดราก, ปัดเศษขึ้น-ลง) เราต้องพิมพ์คำสั่ง import math ไว้ที่บรรทัดบนสุดของไฟล์ก่อน เพื่อขอเรียกใช้กล่องเครื่องมือนี้

2. math.ceil()

• ย่อมาจาก: Ceiling แปลตรงตัวว่า "เพดาน"
• วิธีใช้: ใช้สำหรับปัดเศษของตัวเลขทศนิยม ขึ้นไปเป็นจำนวนเต็มที่อยู่ใกล้ที่สุดเสมอ ไม่ว่าเศษทศนิยมนั้นจะมีค่ามากหรือน้อยเพียงใดก็ตาม (ยกเว้นกรณีที่ตัวเลขนั้นไม่มีเศษทศนิยมเลย เช่น 42 ก็จะได้ 42 เท่าเดิม)
• ตัวอย่างการทำงานตามภาพ:
	• math.ceil(41.42) ผลลัพธ์คือ 42 (ชนเพดานด้านบน)
	• math.ceil(42) ผลลัพธ์คือ 42 (เนื่องจากไม่มีเศษ จึงอยู่ที่เดิม)
	• math.ceil(0.001) ผลลัพธ์คือ 1 (แม้เศษจะน้อยมาก แต่มีเศษปุ๊บจะเด้งขึ้นเพดานทันที)







==============================================================================
'''


