#!/usr/bin/env python3
import sys

# 1. เช็กจำนวนพารามิเตอร์ที่ส่งเข้ามา (ต้องเป็น 1 ตัวพอดีเท่านั้น)
if len(sys.argv) - 1 != 1:
    print("none")
else:
    # 2. ดึงข้อความจากพารามิเตอร์แรกมาแปลงเป็นตัวพิมพ์เล็กทั้งหมดด้วย .lower()
    result = sys.argv[1].lower()
    print(result)






'''
========================== การสร้าง  ==========================

1. การแปลงตัวอักษรเป็นพิมพ์เล็ก (.lower())

• Syntax: .lower()
• คำอธิบาย: ย่อมาจาก Lowercase (ตัวพิมพ์เล็ก) เป็น Method สำเร็จรูปของข้อความ (String) ในภาษา Python
• การใช้งาน: ทำงานตรงกันข้ามกับ .upper() โดยมันจะสแกนตัวอักษรพิมพ์ใหญ่ภาษาอังกฤษทุกตัวในข้อความนั้น แล้วทำการยุบเปลี่ยนให้กลายเป็นตัวพิมพ์เล็กทั้งหมดโดยอัตโนมัติ







==============================================================================
'''


