#!/usr/bin/env python3

def upcase_it(text_string):             # นิยามฟังก์ชัน (หรือ Method) ตามที่โจทย์กำหนด
    return text_string.upper()          # ใช้ Method สำเร็จรูป .upper() เพื่อแปลงเป็นตัวพิมพ์ใหญ่ทั้งหมด

print(upcase_it("hello"))               # ส่วนทดสอบการเรียกใช้งานตามตัวอย่างในโจทย์








'''
========================== การสร้าง  ==========================
syntax:     var.upper()         # การทำให้ var เป็นตัวใหญ่ทั้งหมด


# text_string.upper()

• หลักการทำงาน: .upper() เป็น Method มาตรฐานในภาษา Python 
  ที่ใช้สำหรับแปลงตัวอักษรภาษาอังกฤษในข้อความทั้งหมดให้เป็นตัวพิมพ์ใหญ่ (Uppercase)
• ซึ่งจะต่างจาก .capitalize() (อันนั้นจะแปลงเฉพาะตัวแรกตัวเดียว) แต่ .upper() จะเปลี่ยนทุกตัวอักษรให้เป็นตัวใหญ่ทั้งหมด เช่น จาก "hello" จะกลายเป็น "HELLO"



==============================================================================
'''


