#!/usr/bin/env python3

num1 = int(input("Give me the first number: "))     # รับค่าตัวเลข 2 ตัวจากผู้ใช้ และแปลงเป็นตัวเลขจำนวนเต็ม (Integer) ทันที
num2 = int(input("Give me the second number: "))

print("Thank you!")                                 # แสดงข้อความขอบคุณตามตัวอย่างในภาพ
                                                    # คำนวณและแสดงผลลัพธ์ บวก ลบ หาร คูณ โดยจัดฟอร์แมตให้สวยงาม
print(f"{num1} + {num2} = {num1 + num2}")
print(f"{num1} - {num2} = {num1 - num2}")
print(f"{num1} / {num2} = {int(num1 / num2)}")
print(f"{num1} * {num2} = {num1 * num2}")






'''
========================== การสร้าง  ==========================


2. ตัวดำเนินการคณิตศาสตร์ใน Python (Operators)

ในภาษาคอมพิวเตอร์ เครื่องหมายคำนวณบางตัวจะต่างจากที่เราเขียนในกระดาษครับ:
• + : เครื่องหมาย บวก (Addition)
• - : เครื่องหมาย ลบ (Subtraction)
• * : เครื่องหมาย คูณ (Multiplication) ในคอมพิวเตอร์เราจะใช้เครื่องหมายดอกจันแทนอักษร x
• / : เครื่องหมาย หาร (Division) ใช้เครื่องหมายสแลช (ทับ)

3. เคล็ดลับการพิมพ์ผลลัพธ์เครื่องหมายหาร {int(num1 / num2)}

• ปกติแล้วใน Python การหารด้วยเครื่องหมาย / จะได้ผลลัพธ์ออกมาเป็น เลขทศนิยม (Float) เสมอ เช่น 10 / 2 จะได้ 5.0
• เพื่อให้ผลลัพธ์ออกมาเป็นเลขตัวตรงเป๊ะตามหน้าจอตัวอย่างในโจทย์ (แสดงเลข 5 ไม่มีทศนิยม) เราจึงใช้คำสั่ง int() ครอบผลหารอีกทีหนึ่ง เพื่อแปลงผลลัพธ์ให้กลับเป็นจำนวนเต็มตัดเศษทศนิยมออกครับ







==============================================================================
'''


