#!/usr/bin/env python3
import sys
import re             

args = sys.argv[1:]                     # ตัดเอาเฉพาะพารามิเตอร์ที่ส่งเข้ามา (ไม่รวมชื่อไฟล์สคริปต์)

if len(args) != 2:                      # ตรวจสอบว่ามีพารามิเตอร์ส่งมา "พอดี 2 ตัว" หรือไม่
    print("none")
else:
    keyword = args[0]
    text = args[1]
    
    matches = re.findall(keyword, text)     # ค้นหาคำทั้งหมดที่ตรงกับ keyword ใน text โดยใช้ regex
    
    if len(matches) == 0:                   # ถ้านับจำนวนที่เจอได้ 0 ครั้ง (ไม่พบ) ให้แสดง none
        print("none")
    else:
        print(len(matches))                 # แสดงจำนวนครั้งที่พบคำนั้น





'''
========================== การสร้าง Array ==========================
syntax: import re:
            คำว่า re ย่อมาจาก Regular Expression เป็นโมดูลใน Python 
            ที่ใช้สำหรับการค้นหา จัดการ และตรวจสอบรูปแบบของข้อความ (String)


syntax: re.findall(keyword, text):
            คำสั่งค้นหาคำ (keyword) ที่อยู่ในข้อความทั้งหมด (text) 
            โดยฟังก์ชันนี้จะทำการกวาดหาคำที่ตรงกันแล้วนำมารวมเก็บไว้ในรูปแบบ List 
            หากเจอ 2 ครั้ง ผลลัพธ์จะเป็น List ที่มีสมาชิก 2 ตัว

==============================================================================
syntax: sys.argv[1:]
            (System Argument Variable):
            ตัวแปรประเภท List ที่เก็บค่าพารามิเตอร์ทั้งหมดที่เราพิมพ์ต่อท้ายชื่อไฟล์ตอนรันใน Terminal 
            โดย sys.argv[1:] คือการตัดชื่อไฟล์สคริปต์ทิ้ง เอาเฉพาะข้อมูลที่เราใส่เพิ่มเข้ามา


==============================================================================
'''


