#!/usr/bin/env python3
import sys

# 1. ตรวจสอบจำนวนพารามิเตอร์ก่อน (ต้องส่งมา 1 ตัวพอดีเท่านั้น)
# ถ้าจำนวนพารามิเตอร์ที่หักชื่อไฟล์แล้วไม่เท่ากับ 1 ให้พิมพ์ "none"
if len(sys.argv) - 1 != 1:
    print("none")
else:
    # เก็บค่าพารามิเตอร์ตัวแรกไว้ในตัวแปร target_word
    target_word = sys.argv[1]
    
    # 2. เปิดกล่องรับข้อความจากผู้ใช้ผ่านหน้าจอ Terminal
    user_word = input("What was the parameter? ")
    
    # 3. ใช้เครื่องหมาย == เช็กว่าคำที่พิมพ์เข้ามาตรงกันเป๊ะหรือไม่
    if user_word == target_word:
        print("Good job!")
    else:
        print("Nope, sorry...")






'''
========================== การสร้าง  ==========================

2. เครื่องหมายเปรียบเทียบความเหมือนเป๊ะ (==)

• Syntax: ==
• คำอธิบาย: เรียกว่า Equality Operator (เครื่องหมายเปรียบเทียบความเท่ากัน)
• ข้อควรระวังสำหรับมือใหม่: เครื่องหมายเท่ากับตัวเดียว (=) ใช้สำหรับ 
  "การกำหนดค่า/เอาข้อมูลใส่ตัวแปร" ส่วนเครื่องหมายเท่ากับสองตัวติดกัน (==) 
  ใช้สำหรับ "การตั้งคำถามเปรียบเทียบว่าสองฝั่งเท่ากันหรือไม่"
• การทำงาน: คอมพิวเตอร์จะจับข้อความที่ดึงมาจากพารามิเตอร์แรกตอนรัน (target_word) 
มาประกบเทียบกับคำที่ผู้ใช้เพิ่งพิมพ์ผ่านคีย์บอร์ดเมื่อครู่ (user_word) 
หากตัวอักษรทุกตัวสะกดเหมือนกันและพิมพ์เล็กพิมพ์ใหญ่ตรงกันเป๊ะ 
ผลตรรกะจะออกมาเป็นจริง (True) และวิ่งเข้าบล็อกสั่งชมว่า "Good job!" ครับ









==============================================================================
'''


